const presentationData = {
  introduction: {
    heading: 'Запознавање',
    content:
      'Јас сум Димитар Калапоцев, роден и живеам во Струмица, имам 20 години и се занимавам со веб девелопмент во последните 3 и пол години. Јас ќе ви бидам ментор и инструктор во следните 3 недели, односно 8 часа и се разбира ќе ви бидам на распологање и по завршувањето на курсот. Овој ми е четврти курс за програмирање со JavaScript и се надевам дека ќе можам да ви ја доловам важноста на JavaScript на наједноставен начин. Начинот на кој стигнав овде каде што сум во мојата кариера е преку многу курсеви, многу туторијали и многу саати поминати на проекти, па ќе се потрудам до крајот на овој курс да ве охрабрам и вие да го направите тоа што и јас го направив.',
  },
  'what-is-js': {
    heading: 'Што е JavaScript',
    content:
      'JavaScript е третиот и последен програмски јазик потребен за основно веб програмирање, заедно со HTML и CSS. Целта на JavaScript е да овозможи интерактивни веб страни (прикажување на различни содржини без рефреширање на веб страна, интерактивни мапи, вклучување/исклучување навигации, итн...), преку модифицирање на елементите кои се на веб страната. Во 2023, преку 1.8 милијарди веб страни работат со помош на JavaScript. Со JavaScript имаме пристап до сите елементи кои се на веб страната, преку DOM (Document Object Model), можеме да ги менуваме/модифицираме истите елементи (да додаваме нови елементи, атрибути, мениме содржина), да создаваме функции за автоматизација за чекори кои ги повторуваме и се разбира да реагираме на промени на страна (клик од маус, одредено поминато време, лоадирана веб страна, итн...).',
  },
  'hello-world': {
    heading: "'Hello World'",
    content: 'dummy text for now lol',
    code: "console.log('Hello World');",
  },
};

export default presentationData;
